In [1]:
import pandas as pd
import numpy as np

In [2]:
data = ["car", "pool", "elephant", "zoo", "lapis", "ball"]
index = pd.date_range(start="02/11/2024", periods=6)

In [3]:
s = pd.Series(data=data, index=index, name="My-table")

s

2024-02-11         car
2024-02-12        pool
2024-02-13    elephant
2024-02-14         zoo
2024-02-15       lapis
2024-02-16        ball
Freq: D, Name: My-table, dtype: object

In [4]:
label = ["A", "B", "C", "D", "E", "F"]
rand_data = np.random.rand(6,6)

In [5]:
df = pd.DataFrame(data=rand_data, index=index, columns=label)

df

                   A         B         C         D         E         F
2024-02-11  0.680291  0.005777  0.740727  0.004935  0.367725  0.712375
2024-02-12  0.991630  0.773904  0.091626  0.266065  0.236217  0.345944
2024-02-13  0.467223  0.292169  0.838779  0.838643  0.274071  0.004971
2024-02-14  0.248873  0.166674  0.824907  0.804365  0.557244  0.745644
2024-02-15  0.319911  0.589552  0.955115  0.749849  0.189595  0.591853
2024-02-16  0.965109  0.867696  0.866947  0.241503  0.395500  0.622363

In [6]:
data_table = {
    "A": ["car", "rac"],
    "B": ["pool", "loop"],
    "C": ["elephant", "tnahpele"],
    "D": ["zoo", "ooz"],
    "E": ["lapis", "sipal"],
    "F": ["ball", "llab"],
}

In [7]:
df2 = pd.DataFrame(data=data_table, index=["x","y"])

In [8]:
df2

     A     B         C    D      E     F
x  car  pool  elephant  zoo  lapis  ball
y  rac  loop  tnahpele  ooz  sipal  llab

In [9]:
# IMPORTING TABLE

In [10]:
table = pd.read_csv(filepath_or_buffer="lame_table.csv", dtype="object")

In [11]:
table

  ColumnA ColumnB ColumnC ColumnD
0     123     abc   45.67    true
1     987     def   32.10   false
2     654     ghi   78.90    true
3     321     jkl   15.23   false
4     789     mno   63.45    true

In [12]:
_2th_row = table.iloc[2]
_2th_row

ColumnA      654
ColumnB      ghi
ColumnC    78.90
ColumnD     true
Name: 2, dtype: object

In [13]:
column_columnc = table["ColumnC"]
column_columnc

0    45.67
1    32.10
2    78.90
3    15.23
4    63.45
Name: ColumnC, dtype: object

In [14]:
table = table.rename(index={2: "¬_¬"})

In [15]:
table

    ColumnA ColumnB ColumnC ColumnD
0       123     abc   45.67    true
1       987     def   32.10   false
¬_¬     654     ghi   78.90    true
3       321     jkl   15.23   false
4       789     mno   63.45    true

In [16]:
table = table.rename(columns={"ColumnC": ">:("})
table

    ColumnA ColumnB    >:( ColumnD
0       123     abc  45.67    true
1       987     def  32.10   false
¬_¬     654     ghi  78.90    true
3       321     jkl  15.23   false
4       789     mno  63.45    true

In [17]:
table.iloc[2] = ["ψ(｀∇´)ψ", "ψ(｀∇´)ψ", "ψ(｀∇´)ψ", "ψ(｀∇´)ψ"]

In [18]:
table

     ColumnA  ColumnB      >:(  ColumnD
0        123      abc    45.67     true
1        987      def    32.10    false
¬_¬  ψ(｀∇´)ψ  ψ(｀∇´)ψ  ψ(｀∇´)ψ  ψ(｀∇´)ψ
3        321      jkl    15.23    false
4        789      mno    63.45     true

In [19]:
table["ColumnB"] = ["A", "A", "A", "A", "A"]
table

     ColumnA ColumnB      >:(  ColumnD
0        123       A    45.67     true
1        987       A    32.10    false
¬_¬  ψ(｀∇´)ψ       A  ψ(｀∇´)ψ  ψ(｀∇´)ψ
3        321       A    15.23    false
4        789       A    63.45     true

In [20]:
table.iat[3,2] = "＼（〇_ｏ）／"

In [21]:
table

     ColumnA ColumnB      >:(  ColumnD
0        123       A    45.67     true
1        987       A    32.10    false
¬_¬  ψ(｀∇´)ψ       A  ψ(｀∇´)ψ  ψ(｀∇´)ψ
3        321       A  ＼（〇_ｏ）／    false
4        789       A    63.45     true

In [22]:
c_column = table.iloc[:, 2]  # COLUMN
c_column

0        45.67
1        32.10
¬_¬    ψ(｀∇´)ψ
3      ＼（〇_ｏ）／
4        63.45
Name: >:(, dtype: object

In [23]:
row_2 = table.iloc[2]  # ROW
row_2

ColumnA    ψ(｀∇´)ψ
ColumnB          A
>:(        ψ(｀∇´)ψ
ColumnD    ψ(｀∇´)ψ
Name: ¬_¬, dtype: object

In [24]:
value_on_4_3 = table.iat[4,3]  # Row, column
value_on_4_3

'true'

In [25]:
table.index

Index([0, 1, '¬_¬', 3, 4], dtype='object')

In [37]:
table.to_csv("lame_table_final.csv",  index=False)